gethasPhoto
- Есть 1 фото
- Есть 5 фото
- Есть 10 фото

isHasDescription
- Есть описание

isNotImport
- Добавлено в ручную

getHasLocation
- Город есть в базе данных
- Улица есть в базе данных
- Район есть в базе данных
- Есть координаты
- Есть панорама

getHasArea
- Указана общая площадь
- Указа площадь кухни
- Указана жилая площадь
- Указана площадь участка
- Указана площадь комнат

getHasFloor
- Указан этаж
- Указана этажность

getFormCompleted
- Заполненость полей в соответствии с выбранной категорией